app/views/gossips/show.html.erb

          <h2>Title : <%= @gossips.title %> </h2>
          <p>Author : <%= @gossips.user.first_name %> <%= @gossips.user.last_name %> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 79], ["LIMIT", 1]]