app/views/thegossipproject/gossip_page.html.erb

    <p> <%= @mygossip.content %> </p>
    <p> <%= @mygossip.user.first_name %> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]