app/views/thegossipproject/gossip_page.html.erb

          <h2>Title : <%= @mygossip.title %> </h2>
          <p>Author : <%= @mygossip.user.first_name %> <%= @mygossip.user.last_name %> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]