app/views/thegossipproject/home.html.erb

          <h5 class="card-title">Titre du potin : <%= gossip.title %> </h5>
          <p class=card-text>Prénom : <%= gossip.user.first_name %> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]