app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" ORDER BY "gossips"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    # Méthode qui récupère tous les potins et les envoie à la view index (index.html.erb) pour affichage
    @name = params[:first_name]
    @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 141], ["LIMIT", 1]]
---
  def show
    # Méthode qui récupère le potin concerné et l'envoie à la view show (show.html.erb) pour affichage
    @gossips = Gossip.find(params[:id])

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Emmanuel"], ["content", "Le raquetteur par excellence"], ["user_id", 70], ["created_at", "2019-02-06 12:25:50.241074"], ["updated_at", "2019-02-06 12:25:50.241074"]]
---
  def create
    # Méthode qui créé un potin à partir du contenu du formulaire de new.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
    # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)
  @gossip = Gossip.new(title: params[:title], content: params[:content], 'user_id'=> User.last.id)
  if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 140], ["LIMIT", 1]]
---
  def update
    @gossip = Gossip.find(params[:id])