app/controllers/thegossipproject_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def home
    @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def gossip_page
    @mygossip = Gossip.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
---
  def author_page
    @myauthor = User.find(params[:id])